---
kind: method
id: M:Autodesk.Revit.DB.TableSectionData.CanRemoveRow(System.Int32)
source: html/b9ed4818-fe5d-2e52-f9bd-caeefa7b0efb.htm
---
# Autodesk.Revit.DB.TableSectionData.CanRemoveRow Method

Verifies that if the row at the given index can be removed..

## Syntax (C#)
```csharp
public bool CanRemoveRow(
	int nIndex
)
```

## Parameters
- **nIndex** (`System.Int32`) - An integer index.

## Returns
True if the row can be removed, false otherwise